# タクシー運転手が乗客を乗せる際の席の増減
print('******************************************************************')

# 中身が空のリストseatを定義
seat = []
min = 0
max = 5
# len()は変数の中身の数を数える関数
## ↓判定↓
print(min <= len(seat) < max)

print('******************************************************************')

# personを一人のせる = seatにpを一つ追加する
seat.append('p')
## ↓判定↓
print(min <= len(seat) < max)
### 現在のseatの中身の個数を確認する
print(len(seat))

print('******************************************************************')

## 2人目を追加
seat.append('p')
## ↓判定↓
print(min <= len(seat) < max)
### 現在のseatの中身の個数を確認する
print(len(seat))

print('******************************************************************')

## 3,4人目を追加
seat.append('p')
seat.append('p')
## ↓判定↓
print(min <= len(seat) < max)
### 現在のseatの中身の個数を確認する
print(len(seat))

print('******************************************************************')

## 5人目が入った時点で、max未満の条件に引っかかるのでfalseが出る。次の人は乗れない
seat.append('p')
## ↓判定↓
print(min <= len(seat) < max)
### 現在のseatの中身の個数を確認する
print(len(seat))

print('******************************************************************')

## 一人降りたら、次の人が乗れるようになる
seat.pop(0)
## ↓判定↓
print(min <= len(seat) < max)
### 現在のseatの中身の個数を確認する
print(len(seat))

print('******************************************************************')

