print('**********************************************************************')

a = 1
b = 1

print('**********************************************************************')

# a が b と等しい
# a == b
print(a == b)
print(a == b, type(a == b))

if a == b:
    print('equal')

print('**********************************************************************')

# a が b と異なる
# a != b

print('**********************************************************************')

# a が b よりも小さい
# a < b

print('**********************************************************************')

# a が b よりも大きい
# a > b

print('**********************************************************************')

# a が b 以下である
# a <= b

print('**********************************************************************')

# a が b 以上である
# a >= b

print('**********************************************************************')

# a も b も真であれば真
# a > 0 and b > 0

if a > 0 and b > 0:
    print('a and b are positive')

## andを使わない場合、プログラムが冗長になる
if a > 0:
    if b > 0:
        print('a and b are positive')


print('**********************************************************************')

# a または b が真であれば真
# a > 0 or b > 0
a = -1
b = 1

if a > 0 or b > 0:
    print('a or b is positive')

## orを使わないとプログラムが冗長になる
## if文はelseの条件文がなくても機能する
if a > 0:
    print('a or b is positive')
elif b > 0:
    print('a or b is positive')
