# 関数内関数
print('**********************************************************************')
print('(1)')

# 普通の関数
def outer(a, b):
    print(a, b)

outer(1, 2)

print('**********************************************************************')
print('(2)')

# 関数内関数
# 関数内のみで使用される関数を定義できる
## outerの引数1と2がまず、outer関数a,bに入る
### innerのplus関数の引数a,bに1,2が入る
#### a,bに入った1,2がc,dに入り、returnの処理が行われる
##### rにreturnの結果が返る
def outer(a, b):

    def plus(c, d):
        return c + d
    r = plus(a, b)
    print(r)

outer(1, 2)

print('**********************************************************************')
print('(3)')

# 関数内でのみ行いたい特定の処理がある場合、関数内関数を使用する

def outer(a, b):

    def plus(c, d):
        return c + d

    r1 = plus(a, b)
    r2 = plus(b, a)
    print(r1 + r2)

outer(1, 2)

print('**********************************************************************')






