#単純な足し算
print(2 + 2)

print('**********************************************************************')

#単純な引き算
print(5 - 2)

print('**********************************************************************')

#単純なかけ算
print(5 * 6)

print('**********************************************************************')

#単純なわり算
print(8 / 5)
##割り切れない数字はコンピュータの近似値まで表示してくれる
print(17 / 3)
###整数の商のみ表示したい場合は //で計算
print(17 // 3)
####割った余りを知りたい場合は%を使用
print(17 % 3)



print('**********************************************************************')

#足し/引き/かけ算混合
print(50 - 5 * 6)
print((50 - 5) *6)

print('**********************************************************************')

#整数
print(1, type(1))

print('**********************************************************************')

#浮動小数点数型
print(1.6, type(1.6))
##0を省略しても、浮動小数点型と認識する
print(.6)

print('**********************************************************************')

#べき乗
print(5 * 5)
print(5 ** 2)
print(5 * 5 * 5 * 5 * 5)
print(5 ** 5)

print('**********************************************************************')

x = 5
y = 10

print(x)
print(x * y)

print('**********************************************************************')

#数字を丸める→round関数
##数字の指定は小数点以下の先頭2桁を表示する？
pie = 3.14151515151515
print(pie)
print(round(pie, 2))

print('**********************************************************************')

#math(pythonの数学関数ライブラリ)をインストール
import math

##sqrt = 平方根
result = math.sqrt(25)
print(result)

##log = 
###参考：https://note.nkmk.me/python-math-exp-log/
y = math.log2(10)
print(y)

print('**********************************************************************')

#help関数でライブラリを参照する
print(help(math))

print('**********************************************************************')








